//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Ejecutando el paso %d de %d: Creando el almacén de entidades";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Ejecutando el paso %d de %d: Creando la base de datos de arranque";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Ejecutando el paso %d de %d: Creando la base de datos de cola de solicitud";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Ejecutando el %d de %d: Descargando el almacén de entidades. Recibido %s de %d hasta ahora.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Ejecutando el paso %d de %d: Borrando solicitudes vencidas";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Ejecutando el paso %d de %d: Descargando metadatos";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Ejecutando el paso %d de %d: Ejecutando fusión de cola de solicitudes";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Ejecutando el paso %d de %d: Ejecutando fusión de transacciones";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Ejecutando el paso %d de %d: Ejecutando fusión de creaciones y borrado";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Ejecutando el paso %d de %d: Procesando consultas de definición %s usando %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Ejecutando el paso %d de %d: Procesando solicitudes. Enviando solicitud de modificación %s de %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Ejecutando el paso %d de %d: Volviendo a aplicar modificaciones";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Ejecutando el paso %d de %d: Analizando datos recibidos";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Ejecutando el paso %d de %d: Recibiendo datos del servidor. Recibido %s hasta ahora.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Ejecutando el paso %d de %d: Eliminando relaciones borradas";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Ejecutando el paso %d de %d: Eliminando las solicitudes especificadas como EliminarDespuésCarga";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Ejecutando el paso %d de %d: Enviando datos al servidor. Enviado %s hasta ahora.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Ejecutando el paso %d de %d: Enviando base de datos de almacén de entidades. Enviado %s de %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Ejecutando el paso %d de %d: Enviando base de datos de cola de solicitudes. Enviado %s de %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Ejecutando el paso %d de %d: Iniciando comunicación con el servidor";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Ejecutando el paso %d de %d: Procesando previamente solicitudes antes de carga";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Ejecutando el paso %d de %d: Esperando descarga";

